In [1]:
import numpy as np
import pandas as pd

In [2]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

# 연습문제 4.4.7
- 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.

        bins = [1, 20, 30, 50, 70, 100]
        labels = ["미성년자", "청년", "중년", "장년", "노년"]

- 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [3]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age, bins, labels=labels)
cats

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888     NaN
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [4]:
np.round((cats.value_counts() / cats.count()), 2)

중년      0.34
청년      0.33
미성년자    0.24
장년      0.08
노년      0.01
Name: age, dtype: float64

# 연습문제 4.4.8
- 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

        20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
        20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [5]:
titanic.tail()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[5 rows x 15 columns]

In [6]:
titanic['age_cat'] = pd.cut(titanic.age, bins, labels=labels)
titanic['modified_sex'] = titanic.apply(lambda r : '남성' if r.sex == 'male' else '여성', axis = 1) 
titanic['category3'] = titanic.apply(lambda r : r.age_cat + r.modified_sex if r.age >= 20 else '미성년자', axis = 1)
del titanic['age_cat']
del titanic['modified_sex']
titanic.tail()

     survived  pclass     sex   age  ...  embark_town  alive  alone category3
886         0       2    male  27.0  ...  Southampton     no   True      청년남성
887         1       1  female  19.0  ...  Southampton    yes   True      미성년자
888         0       3  female   NaN  ...  Southampton     no  False      미성년자
889         1       1    male  26.0  ...    Cherbourg    yes   True      청년남성
890         0       3    male  32.0  ...   Queenstown     no   True      중년남성

[5 rows x 16 columns]